<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Kindle Kid's Book Creator for help creating illustrated children's books.</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.KindleKidsBookCreator</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KindleKidsBookCreator</string>
        <key>DOWNLOAD_URL</key>
        <string>https://s3.amazonaws.com/kkbc/KPR/KindleKidsBookCreatorInstaller.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
