<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Kindle Kids' Book Creator for help creating illustrated children's books and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.KindleKidsBookCreator.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KindleKidsBookCreator</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/amazon</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing-amazon-kindlekidsbookcreator</string>
            </array>
            <key>description</key>
            <string>Kindle Kids' Book Creator tool is to help create illustrated children's books.</string>
            <key>display_name</key>
            <string>Kindle Kids' Book Creator</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.KindleKidsBookCreator.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>