<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Google Photos Backup for backing up photos to Google and imports into munki</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.munki.GooglePhotosBackup</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GooglePhotosBackup</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/google</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing-google-googlephotosbackup</string>
            </array>
            <key>description</key>
            <string>Downloads Google Photos Backup for backing up photos</string>
            <key>display_name</key>
            <string>Google Photos Backup</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.GooglePhotosBackup</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>