<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.munki.Portfolio2017</string>
	<key>Description</key>
	<string>Downloads and imports Portfolio 2017 Client into munki.
	</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>Portfolio2017</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/extensis</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing-extensis-portfolio2017</string>
            </array>
            <key>category</key>
            <string>Productivity</string>
            <key>description</key>
            <string>A space saving and resizable palette, Portfolio Express brings your assets directly to your other applications. Drag and drop assets into professional applications such as Adobe InDesign and Microsoft Powerpoint. Search and preview assets in your collections with Portfolio Express to maximize creative output.</string>
            <key>developer</key>
            <string>Extensis</string>
            <key>display_name</key>
            <string>Portfolio 2017</string>
            <key>minimum_os_version</key>
            <string>10.7.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.Portfolio2017</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
	</array>
</dict>
</plist>
