<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.munki.ScratchPlay</string>
	<key>Description</key>
	<string>The ultimate, professional playback and review tool for virtually all production and camera formats.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScratchPlay</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/assimilateinc</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing-assimilateinc-scratchplay</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Assimilate Inc</string>
			<key>minimum_os_version</key>
			<string>10.7</string>
			<key>description</key>
			<string>The ultimate, professional playback and review tool for virtually all production and camera formats.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>Scratch Play</string>
		</dict>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.ScratchPlay</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
                <key>flat_pkg_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/unpacked</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/unpacked/Scratch.pkg/Payload</string>     
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/scratchextracted</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
			<key>Arguments</key>
			<dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/scratchextracted/Scratch.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <string>--pkgvers=%version%</string>
                </array>
            </dict>
        </dict>            
	</array>
</dict>
</plist>
