<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Input</key>
    <dict>
        <key>IDENTIFIER</key>
        <string>com.github.poundbangbash.eholtam-recipes.elgato.munki.thunderbolt2Dock</string>
        <key>NAME</key>
        <string>ElgatoThunderbolt2Dock</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>drivers/elgato</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>development-elgato-thunderbolt2dock</string>
            </array>
            <key>category</key>
            <string>Drivers</string>
            <key>description</key>
            <string>Includes high-power USB support.</string>
            <key>developer</key>
            <string>Elgato</string>
            <key>display_name</key>
            <string>elgato Thunderbolt 2 Dock</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.1</string>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.elgato.download.thunderbolt2Dock</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
