<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.munki.microsoftteams</string>
    <key>Description</key>
    <string>Downloads Microsoft Teams and imports into munki.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftTeams</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/microsoft</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>development-microsoft-microsoftteams</string>
            </array>
			<key>category</key>
			<string>Communication</string>
            <key>description</key>
            <string>Collaboration tool from Microsoft.</string>
            <key>display_name</key>
            <string>Microsoft Teams</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.microsoftteams</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
