<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Movavi Screen Capture Studio and imports into Munki. 
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.munki.MovaviScreenCaptureStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MovaviScreenCaptureStudio</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/movavi</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing-movavi-screencapturestudio</string>
            </array>
            <key>description</key>
            <string>Download this convenient screen recorder for Mac and capture anything you want: video guides, Skype calls, streaming video, and much more.</string>
            <key>display_name</key>
            <string>Movavi Screen Capture Studio</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.MovaviScreenCaptureStudio</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>