<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Movavi Screen Capture Studio</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.MovaviScreenCaptureStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MovaviScreenCaptureStudio</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.movavi.com/download-screencapturemac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Movavi Screen Capture Studio 3.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: GOLDEN SOFTWARE INC. (U8KD48QDBK)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>