<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the iMazing HEIC Converter application.</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.imazing-heic-converter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>imazing-HEIC-converter</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
 			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://imazing.com/heic/download/macos</string>
				<key>re_pattern</key>
				<string>(https:\/\/[\S]+\.dmg)</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>strict_verification</key>
				<true />
				<key>input_path</key>
				<string>%pathname%/iMazing Converter.app</string>
                <key>requirement</key>
                <string>identifier "com.DigiDNA.iMazingHEICConverterMac" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J5PR93692Y</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>