<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.pkg.imazing-heic-converter</string>
    <key>Description</key>
    <string>Downloads the iMazing HEIC Converter application and creates a pkg.</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.imazing-heic-converter</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
