<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Presentation Font Embedder.</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.PresentationFontEmbedder</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PresentationFontEmbedder</string>
		<key>URL</key>
		<string>https://www.moonleo.com/downloads/Presentation%20Font%20Embedder.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
			    <key>url</key>
			    <string>%URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Presentation Font Embedder.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.presentationfontembedder.presentationfontembedder" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = B2ZU2BY35K)</string>
                <key>strict_verification</key>
                <true/>
            </dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
