<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.PortfolioExpress.munki</string>
	<key>Description</key>
	<string>Downloads, re-packages, and imports into Portfolio Express Client into Munki.</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PortfolioExpress</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/extensis</string>
		<key>MUNKI_CATEGORY</key>
		<string>Content Management</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing-extensis-portfolioexpress</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Extensis</string>
			<key>minimum_os_version</key>
			<string>10.9.0</string>
			<key>description</key>
			<string>A space saving and resizable palette, Portfolio Express brings your assets directly to your other applications.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>Portfolio Express</string>
		</dict>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.PortfolioExpress.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%[0-9.]*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
