<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the UniConverter application and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.munki.UniConverter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UniConverter</string>
		<key>repo_subdirectory</key>
		<string>apps/wondershare</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>development-wondershare-uniconverter</string>
			</array>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>UniConverter</string>
			<key>description</key>
			<string>Wondershare UniConverter can convert any video to over 1000 formats at 30X faster speed without quality loss, burn DVD, compress/edit/download/record videos, transfer files to devices.</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.2</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.UniConverter</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
