<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the UniConverter application.</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.UniConverter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UniConverter</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.1</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://cbs.wondershare.com/go.php?m=upgrade_info&amp;pid=967&amp;version=12.0.1</string>
                <key>re_pattern</key>
                <string>(http.?:\/\/download.wondershare.net\/upgrade\/[\S]+.dmg)</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>strict_verification</key>
				<true />
				<key>input_path</key>
				<string>%pathname%/Wondershare UniConverter.app</string>
				<key>requirement</key>
				<string>identifier "com.Wondershare.Video-Converter-Ultimate" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = YZC2T44ZDX</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
