<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.snowflakeODBC</string>
    <key>Description</key>
    <string>Downloads snowflakeODBC.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>snowflakeODBC</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
 			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://sfc-repo.snowflakecomputing.com/odbc/mac64/latest/index.html</string>
				<key>re_pattern</key>
				<string>(?&lt;=a href=")(snowflake[\S]+\.dmg)"</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://sfc-repo.snowflakecomputing.com/odbc/mac64/latest/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/snowflakeODBC.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Snowflake Computing INC. (W4NT6CRQ7U)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
