<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.munki.snowflakeODBC</string>
    <key>Description</key>
    <string>Downloads Snowflake ODBC latest driver and imports into munki.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>snowflakeODBC</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>developer/snowflake</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>development-snowflake-odbc</string>
            </array>
			<key>category</key>
			<string>Developer</string>
            <key>description</key>
            <string>Snowflake provides a driver for connecting to Snowflake using ODBC-based client applications.</string>
			<key>developer</key>
			<string>Snowflake</string>
            <key>display_name</key>
            <string>snowflakeODBC</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>minimum_os_version</key>
            <string>10.12.0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>ParentRecipe</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.snowflakeODBC</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
