<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the PS4 Remote Play application.</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.ps4remoteplay</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.ps4remoteplay</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
		</dict>
    </array>
</dict>
</plist>
