<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Insta360Pro Stitcher application.</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.download.insta360prostitcher</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Insta360ProStitcher</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.insta360.com/download/insta360-pro</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
 			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>re_pattern</key>
				<string>(https://static.insta360.com/Insta360Stitcher/Insta360Stitcher_Mac[\S]+\.pkg)</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Shenzhen Arashi Vision Co., Ltd. (UBX9CH9GDX)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
