<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Extensis Portfolio Desktop</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.PortfolioDesktop</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
        <string>PortfolioDesktop</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.extensis.com/support/portfolio-3/</string>
				<key>re_pattern</key>
				<string>(http.?://bin.extensis.com/portfolio/Portfolio3-Desktop-M-[0-9-]*\.zip)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
			    <key>url</key>
			    <string>%match%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-dmg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-dmg/Portfolio*.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>strict_verification</key>
				<true/>
				<key>input_path</key>
				<string>%found_filename%/Portfolio Desktop.app</string>
				<key>requirement</key>
				<string>identifier "com.electron.portfolio-desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J6MMHGD9D6</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
