<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Suspicious Package application and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.poundbangbash.eholtam-recipes.munki.SuspiciousPackageApp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SuspiciousPackageApp</string>
		<key>repo_subdirectory</key>
		<string>apps/mothersruin</string>
		<key>pkginfo</key>
		<dict>
		    <key>catalogs</key>
		    <array>
		        <string>testing-mothersruin-suspiciouspackage</string>
            </array>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>Suspicious Package App</string>
			<key>description</key>
			<string>Suspicious Package: An Application for Inspecting OS X Installer Packages</string>
			<key>minimum_os_version</key>
			<string>10.9</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.2</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.SuspiciousPackageApp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
