<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the CyberPower PowerPanel app.</string>
    <key>Identifier</key>
    <string>com.github.poundbangbash.eholtam-recipes.install.powerpanel</string>
    <key>Input</key>
    <dict>
        <key>APPNAME</key>
        <string>PowerPanel.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.download.powerpanel</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%APPNAME%</string>
                <key>destination_path</key>
                <string>/Applications/%APPNAME%</string>
            </dict>
		</dict>
    </array>
</dict>
</plist>
